<?php
$arr = [
    "Московская область" => ["Апрелевка","Балашиха","Бронницы","Верея","Видное","Волоколамск","Воскресенск","Высоковск"],
    "Ленинградская область"=> ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань","Касимов","Скопин","Сасово","Ряжск","Новомичуринск","Рыбное","Кораблино",
        "Михайлов","Спасск-Рязанский","Шацк","Спас-Клепики"]
];

function getArr($arr) {
    $result = null;
    foreach ($arr as $key => $value) {
        $result .= "$key:<br>";
        for ($i = 0; $i < count($value); $i++) {
            $result .= "$value[$i], ";
        }
        $result = mb_substr($result, 0,-2) . ".<br>";
    }
    return $result;
}

echo getArr($arr);
